{"format": "layers-model", "generatedBy": "keras v2.3.0-tf", "convertedBy": "TensorFlow.js Converter v3.13.0", "modelTopology": {"keras_version": "2.3.0-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "INPUT"}, "name": "INPUT", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "C1", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "C1", "inbound_nodes": [[["INPUT", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "S1", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "name": "S1", "inbound_nodes": [[["C1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "C3", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "C3", "inbound_nodes": [[["S1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "S4", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "name": "S4", "inbound_nodes": [[["C3", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "FLATTEN", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "FLATTEN", "inbound_nodes": [[["S4", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "F5", "trainable": true, "dtype": "float32", "units": 120, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "F5", "inbound_nodes": [[["FLATTEN", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "F6", "trainable": true, "dtype": "float32", "units": 84, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "F6", "inbound_nodes": [[["F5", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "OUTPUT", "trainable": true, "dtype": "float32", "units": 10, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "OUTPUT", "inbound_nodes": [[["F6", 0, 0, {}]]]}], "input_layers": [["INPUT", 0, 0]], "output_layers": [["OUTPUT", 0, 0]]}}, "training_config": {"loss": "sparse_categorical_crossentropy", "metrics": ["accuracy"], "weighted_metrics": null, "loss_weights": null, "sample_weight_mode": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "C1/kernel", "shape": [5, 5, 1, 6], "dtype": "float32"}, {"name": "C1/bias", "shape": [6], "dtype": "float32"}, {"name": "C3/kernel", "shape": [5, 5, 6, 16], "dtype": "float32"}, {"name": "C3/bias", "shape": [16], "dtype": "float32"}, {"name": "F5/kernel", "shape": [256, 120], "dtype": "float32"}, {"name": "F5/bias", "shape": [120], "dtype": "float32"}, {"name": "F6/kernel", "shape": [120, 84], "dtype": "float32"}, {"name": "F6/bias", "shape": [84], "dtype": "float32"}, {"name": "OUTPUT/kernel", "shape": [84, 10], "dtype": "float32"}, {"name": "OUTPUT/bias", "shape": [10], "dtype": "float32"}]}]}